Maxjta/zephyr/include/zephyr/dt-bindings/clock/at32f45x_clocks.h
/*
 * Copyright (c) 2022 Teslabs Engineering S.L.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F45X_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F45X_CLOCKS_H_

/**
 * Encode crm register offset and configuration bit.
 *
 * - 0..5: bit number
 * - 6..14: offset
 * - 15: reserved
 *
 * @param reg crm register name (expands to AT32{reg}_OFFSET)
 * @param bit Configuration bit
 */
#define AT32_CLOCK_CONFIG(reg, bit) \
	(((AT32_ ## reg ## _OFFSET) << 6U) | (bit))

/**
 * @name Register offsets
 * @{
 */

#define AT32_AHB1EN_OFFSET       0x30U
#define AT32_AHB2EN_OFFSET       0x34U
#define AT32_AHB3EN_OFFSET       0x38U
#define AT32_APB1EN_OFFSET       0x40U
#define AT32_APB2EN_OFFSET       0x44U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB1 peripherals */
#define AT32_CLOCK_GPIOA      AT32_CLOCK_CONFIG(AHB1EN, 0)
#define AT32_CLOCK_GPIOB      AT32_CLOCK_CONFIG(AHB1EN, 1)
#define AT32_CLOCK_GPIOC      AT32_CLOCK_CONFIG(AHB1EN, 2)
#define AT32_CLOCK_GPIOD      AT32_CLOCK_CONFIG(AHB1EN, 3)
#define AT32_CLOCK_GPIOE      AT32_CLOCK_CONFIG(AHB1EN, 4)
#define AT32_CLOCK_GPIOF      AT32_CLOCK_CONFIG(AHB1EN, 5)
#define AT32_CLOCK_GPIOG      AT32_CLOCK_CONFIG(AHB1EN, 6)
#define AT32_CLOCK_GPIOH      AT32_CLOCK_CONFIG(AHB1EN, 7)
#define AT32_CLOCK_CRC        AT32_CLOCK_CONFIG(AHB1EN, 12)
#define AT32_CLOCK_DMA1       AT32_CLOCK_CONFIG(AHB1EN, 22)
#define AT32_CLOCK_DMA2       AT32_CLOCK_CONFIG(AHB1EN, 24)
#define AT32_CLOCK_EMAC       AT32_CLOCK_CONFIG(AHB1EN, 25)
#define AT32_CLOCK_EMACTX     AT32_CLOCK_CONFIG(AHB1EN, 26)
#define AT32_CLOCK_EMACRX     AT32_CLOCK_CONFIG(AHB1EN, 27)
#define AT32_CLOCK_EMACPTP    AT32_CLOCK_CONFIG(AHB1EN, 28)

/* AHB2 peripherals */
#define AT32_CLOCK_AES        AT32_CLOCK_CONFIG(AHB2EN, 4)
#define AT32_CLOCK_TRNG       AT32_CLOCK_CONFIG(AHB2EN, 6)
#define AT32_CLOCK_USBFS      AT32_CLOCK_CONFIG(AHB2EN, 7)
#define AT32_CLOCK_SDIO1      AT32_CLOCK_CONFIG(AHB2EN, 15)

/* AHB3 peripherals */
#define AT32_CLOCK_XMC        AT32_CLOCK_CONFIG(AHB3EN, 0)
#define AT32_CLOCK_QSPI1      AT32_CLOCK_CONFIG(AHB3EN, 1)

/* APB1 peripherals */
#define AT32_CLOCK_TIMER2     AT32_CLOCK_CONFIG(APB1EN, 0)
#define AT32_CLOCK_TIMER3     AT32_CLOCK_CONFIG(APB1EN, 1)
#define AT32_CLOCK_TIMER4     AT32_CLOCK_CONFIG(APB1EN, 2)
#define AT32_CLOCK_TIMER5     AT32_CLOCK_CONFIG(APB1EN, 3)
#define AT32_CLOCK_TIMER6     AT32_CLOCK_CONFIG(APB1EN, 4)
#define AT32_CLOCK_TIMER7     AT32_CLOCK_CONFIG(APB1EN, 5)
#define AT32_CLOCK_TIMER12    AT32_CLOCK_CONFIG(APB1EN, 6)
#define AT32_CLOCK_TIMER13    AT32_CLOCK_CONFIG(APB1EN, 7)
#define AT32_CLOCK_TIMER14    AT32_CLOCK_CONFIG(APB1EN, 8)
#define AT32_CLOCK_WWDT       AT32_CLOCK_CONFIG(APB1EN, 11)
#define AT32_CLOCK_SPI2       AT32_CLOCK_CONFIG(APB1EN, 14)
#define AT32_CLOCK_SPI3       AT32_CLOCK_CONFIG(APB1EN, 15)
#define AT32_CLOCK_USART2     AT32_CLOCK_CONFIG(APB1EN, 17)
#define AT32_CLOCK_USART3     AT32_CLOCK_CONFIG(APB1EN, 18)
#define AT32_CLOCK_USART4     AT32_CLOCK_CONFIG(APB1EN, 19)
#define AT32_CLOCK_USART5     AT32_CLOCK_CONFIG(APB1EN, 20)
#define AT32_CLOCK_I2C1       AT32_CLOCK_CONFIG(APB1EN, 21)
#define AT32_CLOCK_I2C2       AT32_CLOCK_CONFIG(APB1EN, 22)
#define AT32_CLOCK_I2C3       AT32_CLOCK_CONFIG(APB1EN, 23)
#define AT32_CLOCK_CAN1       AT32_CLOCK_CONFIG(APB1EN, 25)
#define AT32_CLOCK_CAN2       AT32_CLOCK_CONFIG(APB1EN, 26)
#define AT32_CLOCK_CAN3       AT32_CLOCK_CONFIG(APB1EN, 27)
#define AT32_CLOCK_PWC        AT32_CLOCK_CONFIG(APB1EN, 28)
#define AT32_CLOCK_DAC        AT32_CLOCK_CONFIG(APB1EN, 29)
#define AT32_CLOCK_UART7      AT32_CLOCK_CONFIG(APB1EN, 30)
#define AT32_CLOCK_UART8      AT32_CLOCK_CONFIG(APB1EN, 31)

/* APB2 peripherals */
#define AT32_CLOCK_TIMER1     AT32_CLOCK_CONFIG(APB2EN, 0)
#define AT32_CLOCK_TIMER8     AT32_CLOCK_CONFIG(APB2EN, 1)
#define AT32_CLOCK_USART1     AT32_CLOCK_CONFIG(APB2EN, 4)
#define AT32_CLOCK_USART6     AT32_CLOCK_CONFIG(APB2EN, 5)
#define AT32_CLOCK_ADC1       AT32_CLOCK_CONFIG(APB2EN, 8)
#define AT32_CLOCK_ADC2       AT32_CLOCK_CONFIG(APB2EN, 9)
#define AT32_CLOCK_SPI1       AT32_CLOCK_CONFIG(APB2EN, 12)
#define AT32_CLOCK_SPI4       AT32_CLOCK_CONFIG(APB2EN, 13)
#define AT32_CLOCK_SYSCFG     AT32_CLOCK_CONFIG(APB2EN, 14)
#define AT32_CLOCK_TIMER9     AT32_CLOCK_CONFIG(APB2EN, 16)
#define AT32_CLOCK_TIMER10    AT32_CLOCK_CONFIG(APB2EN, 17)
#define AT32_CLOCK_TIMER11    AT32_CLOCK_CONFIG(APB2EN, 18)
#define AT32_CLOCK_I2SF5      AT32_CLOCK_CONFIG(APB2EN, 20)
#define AT32_CLOCK_ACC        AT32_CLOCK_CONFIG(APB2EN, 29)
#define AT32_CLOCK_I2S2EXT    AT32_CLOCK_CONFIG(APB2EN, 30)
#define AT32_CLOCK_I2S3EXT    AT32_CLOCK_CONFIG(APB2EN, 31)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F45X_CLOCKS_H_ */
